{
	"name": "Synchrotron Accelerator",
	"icon": "qmd:ring_accelerator_controller",
	"category": "qmd:accelerators",
	"sortnum": 2,
	"pages": [
		{
			"type": "text",
			"text": "$(thing)Synchrotron Accelerators$() accelerate particles to much higher energies than $(l:accelerators/linear_accelerator)Linear Accelerators$(/l), however, they cannot be the start of an accelerator system. $(bold)Synchrotrons have a minimum input particle energy$(), usually 5 MeV, however this value is configurable."
		},
		{
			"anchor": "construction",
			"title": "Construction",
			"type": "text",
			"text": "Synchrotron Accelerators are a square torus of $(item)Accelerator Casings$() and or $(item)Accelerator Glass$() that must be five blocks wide and tall. There must be a continuous line of $(item)Accelerator Beam Blocks$() down the center of the accelerator. Any $(item)Accelerator Beam Port$() must be placed at same level as the beam ring, and there must be a beam block connecting it to the beam ring. $(bold)At each corner and beam port, there must be a Dipole Magnet$()."
		},
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/empty_synch.png"
            ],
            "text": "Example of the arrangement of beam blocks within a Synchotron."
        },
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/synch_dipoles.png"
            ],
            "text": "Same Synchrotron, now with dipoles."
        },
		{
           "title": "Particle Energy",
			"type": "text",
			"text": "The resulting particle energy of a synchrotron is determined by two factors, the dipole field strength, and the synchrotron radiation losses. Whichever factor is smaller will be the maximum particle output energy."
        },
		{
			"anchor": "max_dipole",
			"type": "text",
			"title": "Dipole Field Strength",
			"text": "The maximum energy (in GeV) from the dipole strength can be calculated using the equation $(thing)Eₓ=1000(qB₂R)²/(2m)$() where $(thing)q$() is the particle's charge, $(thing)B₂$() is the dipole strength, which is the sum of the strengths of the dipoles within the accelerator, $(thing)R$() is the radius of the synchrotron, and $(thing)m$() is the mass of the particle. For heavier particles like the proton, this is the major concern."
        },
		{
			"anchor": "max_radation",
			"type": "text",
			"title": "Synchrotron Radiation",
			"text": "The maximum energy (in GeV) from the Radiation losses can be calculated using the equation $(thing)Eᵣ=1000m(3VR/|q|)⁰˙²⁵$() where $(thing)V$() is the accelerator's voltage (in kV), $(thing)R$() is the radius of the synchrotron, and $(thing)q$() is the particle's charge. For lighter particles like the electron, this is the major concern."
        },
		{
           "anchor": "synchrotron_Port",
		   "title": "Synchrotron Ports",
			"type": "blocks/1",
			"block": "qmd:accelerator_synchrotron_port",
			"text": "Synchrotrons can have one special port installed, an $(item)Accelerator Synchrotron Port$(). This port lets out synchrotron radiation (High energy photons). The amount of pu/t of photons produced is equal to the amount of pu/t of particles going through the Synchrotron, and the focus is the same as the particles going through the synchrotron."
        },
		{
			"type": "text",
			"text": "The energy of the photons (in MeV) can be calculated using the equation $(thing)Eᵧ=E³/(2πR(1000m)³)$() where $(thing)E is the energy (in MeV) of the primary particle outputted by the synchrotron, and $(thing)R$() is the radius of the synchrotron."
        },
		{
            "type": "image",
            "images": [
                "qmd:textures/gui/book_images/synch_port.png"
            ],
            "text": "Synchrotron Port set up."
        }
	]
}